//Создать класс машина, имеющий марку(указатель на строку), 
//число цилиндров, мощность.Определить конструкторы, деструктор и функцию печати.

//Создать public - производный класс - грузовики, имеющий грузоподъемность кузова.
//Определить конструкторы по умолчанию и с разным числом параметров, деструкторы, функцию печати.
//Определить функции переназначения марки и грузоподъемности.

//Написать программу, демонстрирующую все разработанные элементы класса.

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");



	return 0;
}